Table of Contents
 Class Selection
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
public abstract class Selection
Inheritance
object
Selection
Derived
BulkSelection
SingleSelection
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 Selection(ISet<IIdeaNode>, ISet<IIdeaMember1D>, ISet<IIdeaMember2D>)
protected Selection(ISet<IIdeaNode> nodes, ISet<IIdeaMember1D> members, ISet<IIdeaMember2D> members2D)
Parameters
nodes ISet<IIdeaNode>
members ISet<IIdeaMember1D>
members2D ISet<IIdeaMember2D>
Properties
 Members
public ISet<IIdeaMember1D> Members { get; }
Property Value
ISet<IIdeaMember1D>
 Members2D
public ISet<IIdeaMember2D> Members2D { get; }
Property Value
ISet<IIdeaMember2D>
 Nodes
public ISet<IIdeaNode> Nodes { get; }
Property Value
ISet<IIdeaNode>
 Edit this page